---
kind: property
id: P:Autodesk.Revit.DB.FilterDoubleRule.Epsilon
source: html/13c869c9-42d1-afda-fc1f-6371777c384b.htm
---
# Autodesk.Revit.DB.FilterDoubleRule.Epsilon Property

The tolerance within which two floating-point values may be considered equal.

## Syntax (C#)
```csharp
public double Epsilon { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The given value for epsilon is not finite
 -or-
 When setting this property: The given value for epsilon is not a number